# 2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
# над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.

print('\n                   -= Задание 2 =-')
print('Программа выполняет логические операции над числами 5 и 6')

print("Побитовое 'И': '0101' & '0110' = '0100' т.е  4")
print(f'{5} & {6} = {5 & 6}')
print("Побитовое 'ИЛИ': '0101' & '0110' = '111' т.е  7")
print(f'{5} | {6} = {5 | 6}')
print("Побитовое 'XOR': '0101' ^ '0110' = '011' т.е  3")
print(f'{5} ^ {6} = {5 ^ 6}')
print("Побитовое 'НЕ': ~'00000101' = '11111010' т.е  -6 ")
print(f'~ {5}  = {~ 5}')
print("Побитовое сдвиг влево '101' << 2 = '10100' т.е  20 (5 * 2 ** 2) ")
print(f'~ {5} << {2} = {5 << 2}')
print("Побитовое сдвиг влево '101' >> 2 = '001'  т.е  1 (5 // (2 ** 2)) ")
print(f'~ {5} >> {2} = {5 >> 2}')
